### Daniels kod för keith galli's pandas data science youtube film

https://www.youtube.com/watch?v=eMOA1pPVUc4

#### Sales analysis

##### Import libraries

In [6]:
import pandas as pd
import os

In [45]:
#df = pd.read_csv("./SalesAnalysis/Sales_Data/Sales_April_2019.csv")

files = [file for file in os.listdir('./SalesAnalysis/Sales_Data')]

all_months_data = pd.DataFrame()


for file in files:
    df = pd.read_csv("./SalesAnalysis/Sales_Data/"+file) #reads into dataframe
    all_months_data = pd.concat([all_months_data, df]) # varför square bracket?
    
#all_months_data.head()
all_months_data.to_csv("all_data.csv", index=False) # utan index=False blir det en tom fil, varför?

##### Read in updated dataframe containg all data

In [46]:
all_data = pd.read_csv("all_data.csv")
all_data.head()

,Order ID,Product,Quantity Ordered,Price Each,Order Date,Purchase Address
0,176558,USB-C Charging Cable,2,11.95,04/19/19 08:46,"917 1st St, Dallas, TX 75001"
1,NaN,NaN,NaN,NaN,NaN,NaN
2,176559,Bose SoundSport Headphones,1,99.99,04/07/19 22:30,"682 Chestnut St, Boston, MA 02215"
3,176560,Google Phone,1,600,04/12/19 14:38,"669 Spruce St, Los Angeles, CA 90001"
4,176560,Wired Headphones,1,11.99,04/12/19 14:38,"669 Spruce St, Los Angeles, CA 90001"

#### Cleaning data, getting rid of nan's
##### Are there any nan's? Counting them.

In [47]:
all_data.isnull().values.any() # identifierar om det finns nan's i hela dataframen

True

In [48]:
all_data.isnull().sum().sum() # räknar antalet nan's i hela dataframen

3270

#### Drop rows of nan's

In [49]:
nan_df = all_data[all_data.isna().any(axis=1)] #Satckoverflow https://stackoverflow.com/questions/43424199/display-rows-with-one-or-more-nan-values-in-pandas-dataframe
nan_df.head(10)

     Order ID Product Quantity Ordered Price Each Order Date Purchase Address
1         NaN     NaN              NaN        NaN        NaN              NaN
356       NaN     NaN              NaN        NaN        NaN              NaN
735       NaN     NaN              NaN        NaN        NaN              NaN
1433      NaN     NaN              NaN        NaN        NaN              NaN
1553      NaN     NaN              NaN        NaN        NaN              NaN
1571      NaN     NaN              NaN        NaN        NaN              NaN
1992      NaN     NaN              NaN        NaN        NaN              NaN
2265      NaN     NaN              NaN        NaN        NaN              NaN
2798      NaN     NaN              NaN        NaN        NaN              NaN
3024      NaN     NaN              NaN        NaN        NaN              NaN

#### Daniels egna försök att ta bort rader med nan's

In [50]:
all_data = all_data.dropna(how='all') # how: default är 'ny'. 'all' ger samma resultat i detta fallet
all_data.isnull().sum().sum() # räknar antalet nan's i hela dataframen

0

#### kollar i datan vad som är "Or" i "Order Date"

In [66]:
temp_df = all_data[all_data['Order Date'].str[0:2] == 'Or']
temp_df.head(15)

,Order ID,Product,Quantity Ordered,Price Each,Order Date,Purchase Address
519,Order ID,Product,Quantity Ordered,Price Each,Order Date,Purchase Address
1149,Order ID,Product,Quantity Ordered,Price Each,Order Date,Purchase Address
1155,Order ID,Product,Quantity Ordered,Price Each,Order Date,Purchase Address
2878,Order ID,Product,Quantity Ordered,Price Each,Order Date,Purchase Address
2893,Order ID,Product,Quantity Ordered,Price Each,Order Date,Purchase Address
3036,Order ID,Product,Quantity Ordered,Price Each,Order Date,Purchase Address
3209,Order ID,Product,Quantity Ordered,Price Each,Order Date,Purchase Address
3618,Order ID,Product,Quantity Ordered,Price Each,Order Date,Purchase Address
4138,Order ID,Product,Quantity Ordered,Price Each,Order Date,Purchase Address
4645,Order ID,Product,Quantity Ordered,Price Each,Order Date,Purchase Address
4794,Order ID,Product,Quantity Ordered,Price Each,Order Date,Purchase Address
5303,Order ID,Product,Quantity Ordered,Price Each,Order Date,Purchase Address
6939,Order ID,Product,Quantity Ordered,Price Each,Order Date,Purchase Address
7497,Order ID,Product,Quantity Ordered,Price Each,Order Date,Purchase Address
8635,Order ID,Product,Quantity Ordered,Price Each,Order Date,Purchase Address

### Remove all rows in all_data som har "Or" som de två första o "Order Date". This by doing same thing as above but using "not equal to" instead.

In [68]:
all_data = all_data[all_data['Order Date'].str[0:2] != 'Or']
all_data.head()

,Order ID,Product,Quantity Ordered,Price Each,Order Date,Purchase Address
0,176558,USB-C Charging Cable,2,11.95,04/19/19 08:46,"917 1st St, Dallas, TX 75001"
2,176559,Bose SoundSport Headphones,1,99.99,04/07/19 22:30,"682 Chestnut St, Boston, MA 02215"
3,176560,Google Phone,1,600,04/12/19 14:38,"669 Spruce St, Los Angeles, CA 90001"
4,176560,Wired Headphones,1,11.99,04/12/19 14:38,"669 Spruce St, Los Angeles, CA 90001"
5,176561,Wired Headphones,1,11.99,04/30/19 09:27,"333 8th St, Los Angeles, CA 90001"

#### Adding a month column to data frame

In [69]:
all_data['Month'] = all_data['Order Date'].str[0:2]
all_data['Month'] = all_data['Month'].astype('int32')
all_data.head()

,Order ID,Product,Quantity Ordered,Price Each,Order Date,Purchase Address,Month
0,176558,USB-C Charging Cable,2,11.95,04/19/19 08:46,"917 1st St, Dallas, TX 75001",4
2,176559,Bose SoundSport Headphones,1,99.99,04/07/19 22:30,"682 Chestnut St, Boston, MA 02215",4
3,176560,Google Phone,1,600,04/12/19 14:38,"669 Spruce St, Los Angeles, CA 90001",4
4,176560,Wired Headphones,1,11.99,04/12/19 14:38,"669 Spruce St, Los Angeles, CA 90001",4
5,176561,Wired Headphones,1,11.99,04/30/19 09:27,"333 8th St, Los Angeles, CA 90001",4

#### Which month was best wrt sales value? How much was earned?